Part 5/CarService/CarHost/App_messages.svclog

<E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2017-12-19T07:04:00.6697590Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{527fb389-b5b4-4cba-ac18-22fb0e44e4fa}" /><Execution ProcessName="CarHost" ProcessID="11152" ThreadID="3" /><Channel/><Computer>KPO8546</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2017-12-19T10:04:00.6597589+03:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPoxxbBOUiHuFEhf2Tp/htOc4AAAAAssnu95mU20Kie5mFDFeP06+iGGRWwgZErzwaCuwf1yAACQAA</VsDebuggerCausalityData><SOAPAction>"http://tempuri.org/ICarService/GetCar"</SOAPAction><Connection>Keep-Alive</Connection><Content-Length>354</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Accept-Encoding>gzip, deflate</Accept-Encoding><Expect>100-continue</Expect><Host>localhost:8080</Host></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="1ef0c937-cf76-47ab-8cff-ffe3b09c238c" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId><To s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://localhost:8080/CarService</To><Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://tempuri.org/ICarService/GetCar</Action></s:Header><s:Body><GetCar xmlns="http://tempuri.org/"><id>1</id></GetCar></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2017-12-19T07:04:00.6997593Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{527fb389-b5b4-4cba-ac18-22fb0e44e4fa}" /><Execution ProcessName="CarHost" ProcessID="11152" ThreadID="3" /><Channel/><Computer>KPO8546</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2017-12-19T10:04:00.6997593+03:00" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/ICarService/GetCarResponse</Action></Addressing><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="02d2dd80-979f-4c64-8702-c03b6a4b6dd7" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId></s:Header><s:Body><GetCarResponse xmlns="http://tempuri.org/"><GetCarResult xmlns:a="http://schemas.datacontract.org/2004/07/CarService" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:Id>1</a:Id><a:Model>Versa</a:Model><a:Vendor>Toyota</a:Vendor><a:Year>2014</a:Year></GetCarResult></GetCarResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2017-12-19T07:04:46.5170900Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{27944f78-21e8-490e-9d30-1bdb7e442f07}" /><Execution ProcessName="CarHost" ProcessID="11152" ThreadID="3" /><Channel/><Computer>KPO8546</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2017-12-19T10:04:46.5170900+03:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPox1bBOUiHuFEhf2Tp/htOc4AAAAAssnu95mU20Kie5mFDFeP06+iGGRWwgZErzwaCuwf1yAACQAA</VsDebuggerCausalityData><SOAPAction>"http://tempuri.org/ICarService/GetCar"</SOAPAction><Content-Length>356</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Accept-Encoding>gzip, deflate</Accept-Encoding><Expect>100-continue</Expect><Host>localhost:8080</Host></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="cf6d22de-1acd-4968-be4a-890fb4a1403f" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId><To s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://localhost:8080/CarService</To><Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://tempuri.org/ICarService/GetCar</Action></s:Header><s:Body><GetCar xmlns="http://tempuri.org/"><id>111</id></GetCar></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2017-12-19T07:04:46.6670855Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{27944f78-21e8-490e-9d30-1bdb7e442f07}" /><Execution ProcessName="CarHost" ProcessID="11152" ThreadID="3" /><Channel/><Computer>KPO8546</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2017-12-19T10:04:46.6670855+03:00" Source="TransportSend" Type="System.ServiceModel.Channels.BodyWriterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://schemas.microsoft.com/net/2005/12/windowscommunicationfoundation/dispatcher/fault</Action></Addressing><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><s:Fault><faultcode xmlns:a="http://schemas.microsoft.com/net/2005/12/windowscommunicationfoundation/dispatcher" xmlns="">a:InternalServiceFault</faultcode><faultstring xml:lang="ru-RU" xmlns="">Сервер не смог обработать запрос в связи с внутренней ошибкой.  Для получения дополнительных сведений об ошибке либо включите IncludeExceptionDetailInFaults (с помощью атрибута ServiceBehaviorAttribute или через поведение &lt;serviceDebug &gt;) на сервере для того чтобы выслать информацию об исключении назад клиенту, или включить трассировку согласно инструкции Microsoft .NET Framework SDK и проверить записи журнала трассировки клиента.</faultstring></s:Fault></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent>