Part 5/CarService/CarClient/App_messages.svclog

<E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2017-12-19T06:47:37.8720761Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{fc3313f1-90b9-44f4-83c1-382315707643}" /><Execution ProcessName="CarClient" ProcessID="6372" ThreadID="1" /><Channel/><Computer>KPO8546</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2017-12-19T09:47:37.8720761+03:00" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/ICarService/GetCar</Action><To>http://localhost:8080/CarService</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo/E4aDV8DfhPhVVE/c63uEEAAAAAQmrOKAstRE625rnyxeBTAaI0zGRYYxJIoBA2hH/ufeIACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="bd2a34d0-f33a-47f3-8120-a2cb7a0ce029" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId></s:Header><s:Body><GetCar xmlns="http://tempuri.org/"><id>1</id></GetCar></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2017-12-19T06:47:37.9020773Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{fc3313f1-90b9-44f4-83c1-382315707643}" /><Execution ProcessName="CarClient" ProcessID="6372" ThreadID="1" /><Channel/><Computer>KPO8546</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2017-12-19T09:47:37.9020773+03:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>383</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Tue, 19 Dec 2017 06:47:37 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><GetCarResponse xmlns="http://tempuri.org/"><GetCarResult xmlns:a="http://schemas.datacontract.org/2004/07/CarService" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:Id>1</a:Id><a:Model>Versa</a:Model><a:Vendor>Toyota</a:Vendor><a:Year>2014</a:Year></GetCarResult></GetCarResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2017-12-19T07:04:00.6297586Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{f51703b9-672e-42c3-ac9b-b4034d818980}" /><Execution ProcessName="CarClient" ProcessID="10280" ThreadID="1" /><Channel/><Computer>KPO8546</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2017-12-19T10:04:00.6297586+03:00" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/ICarService/GetCar</Action><To>http://localhost:8080/CarService</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPoxxbBOUiHuFEhf2Tp/htOc4AAAAAssnu95mU20Kie5mFDFeP06+iGGRWwgZErzwaCuwf1yAACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="1ef0c937-cf76-47ab-8cff-ffe3b09c238c" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId></s:Header><s:Body><GetCar xmlns="http://tempuri.org/"><id>1</id></GetCar></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2017-12-19T07:04:00.6997593Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{f51703b9-672e-42c3-ac9b-b4034d818980}" /><Execution ProcessName="CarClient" ProcessID="10280" ThreadID="1" /><Channel/><Computer>KPO8546</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2017-12-19T10:04:00.6997593+03:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>588</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Tue, 19 Dec 2017 07:04:00 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="02d2dd80-979f-4c64-8702-c03b6a4b6dd7" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId></s:Header><s:Body><GetCarResponse xmlns="http://tempuri.org/"><GetCarResult xmlns:a="http://schemas.datacontract.org/2004/07/CarService" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:Id>1</a:Id><a:Model>Versa</a:Model><a:Vendor>Toyota</a:Vendor><a:Year>2014</a:Year></GetCarResult></GetCarResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2017-12-19T07:04:46.5170900Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{03f1abb1-18e5-44b7-85d9-d113be41b85e}" /><Execution ProcessName="CarClient" ProcessID="10280" ThreadID="1" /><Channel/><Computer>KPO8546</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2017-12-19T10:04:46.5170900+03:00" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/ICarService/GetCar</Action><To>http://localhost:8080/CarService</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPox1bBOUiHuFEhf2Tp/htOc4AAAAAssnu95mU20Kie5mFDFeP06+iGGRWwgZErzwaCuwf1yAACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="cf6d22de-1acd-4968-be4a-890fb4a1403f" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId></s:Header><s:Body><GetCar xmlns="http://tempuri.org/"><id>111</id></GetCar></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2017-12-19T07:04:46.6770852Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{03f1abb1-18e5-44b7-85d9-d113be41b85e}" /><Execution ProcessName="CarClient" ProcessID="10280" ThreadID="1" /><Channel/><Computer>KPO8546</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2017-12-19T10:04:46.6770852+03:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>InternalServerError</StatusCode><StatusDescription>Internal Server Error</StatusDescription><WebHeaders><Content-Length>1018</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Tue, 19 Dec 2017 07:04:46 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><s:Fault><faultcode xmlns:a="http://schemas.microsoft.com/net/2005/12/windowscommunicationfoundation/dispatcher" xmlns="">a:InternalServiceFault</faultcode><faultstring xml:lang="ru-RU" xmlns="">Сервер не смог обработать запрос в связи с внутренней ошибкой.  Для получения дополнительных сведений об ошибке либо включите IncludeExceptionDetailInFaults (с помощью атрибута ServiceBehaviorAttribute или через поведение &lt; serviceDebug &gt;) на сервере для того чтобы выслать информацию об исключении назад клиенту, или включить трассировку согласно инструкции Microsoft .NET Framework SDK и проверить записи журнала трассировки клиента.</faultstring></s:Fault></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent>